# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "koekeishiya/formulae"
tap "neovim/neovim"

# Binaries
brew "autoconf"
brew "autoenv"
brew "bash" # Bash 4
brew "ccat"
brew "coreutils" # Those that come with macOS are outdated
brew "dfc"
brew "fish"
brew "fzf"
brew "git"
brew "git-secrets"
brew "gnupg"
brew "htop"
brew "ifstat"
brew "jq"
brew "keychain"
brew "lynx"
brew "mas"
brew "neovim"
brew "gopass"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "tag"
brew "tmux"
brew "trash"
brew "tree"
brew "urlview"
brew "wget"
brew "yadm"
brew "z"

# Development
brew "cmake"
brew "ctags"
brew "go"
brew "imagemagick"
brew "libpng"
brew "node"
brew "nvm"
brew "pipenv"
brew "python"
brew "yarn"

# Aplications
cask "iterm2"
cask "appcleaner"
cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "gpg-suite"
cask "slack"
cask "telegram"
cask "whatsapp"
cask "visual-studio-code"
cask "obsidian"
cask "amazon-photos"
cask "megasync"
cask "rectangle"

# QuickLock plugins
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "suspicious-package"
cask "webpquicklook"

# Mac App Store
mas "Alfred", id: 405843582
mas "Amphetamine", id: 937984704
mas "Spark", id: 1176895641
mas "The Unarchiver", id: 425424353
mas "Todoist", id: 585829637
mas "Unsplash", id: 1284863847
mas "Xcode", id: 497799835
