# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "koekeishiya/formulae"
tap "neovim/neovim"

# Binaries
brew "autoconf"
brew "autoenv"
brew "bash" # Bash 4
brew "ccat"
brew "coreutils" # Those that come with macOS are outdated
brew "dfc"
brew "fish"
brew "fzf"
brew "git"
brew "htop"
brew "ifstat"
brew "jq"
brew "keychain"
brew "neovim"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "tag"
brew "tmux"
brew "trash"
brew "tree"
brew "urlview"
brew "wget"
brew "yadm"
brew "zoxide"

# Development
brew "cmake"
brew "ctags"
brew "go"
brew "imagemagick"
brew "libpng"
brew "node"
brew "nvm"
brew "pipenv"
brew "python"
brew "yarn"

# Aplications
cask "appcleaner"
cask "dozer"
# cask "dropbox"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "kap"
cask "megasync"
cask "mimestream"
cask "obsidian"
cask "rectangle"
cask "slack"
cask "telegram"
cask "visual-studio-code"
cask "whatsapp"


# Mac App Store
mas "Amphetamine", id: 937984704
mas "The Unarchiver", id: 425424353
mas "Todoist", id: 585829637
mas "Unsplash", id: 1284863847