jhillyerd/plugin-git
jethrokuan/z
brigand/fast-nvm-fish
edc/bass
tuvistavie/fish-ssh-agent
kennethreitz/fish-pipenv
jorgebucaran/fish-nvm
oh-my-fish/plugin-node-binpath
