2gua.rainbow-brackets
aaron-bond.better-comments
dbaeumer.vscode-eslint
donjayamanne.githistory
dsznajder.es7-react-js-snippets
eamodio.gitlens
EditorConfig.EditorConfig
esbenp.prettier-vscode
mikestead.dotenv
ms-python.python
Orta.vscode-jest
pflannery.vscode-versionlens
redhat.vscode-yaml
vscode-icons-team.vscode-icons
vscodevim.vim
